tdxguiping/ESP32_S3_epaper/main/led_status/led_status.c
#include "led_status.h"

#include "ch583_wifi_uart_protocol.h"
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "tdx_cfg.h"

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

static const char *TAG = "led_status";
static TaskHandle_t s_led_task;
static QueueHandle_t s_led_event_queue;
static SemaphoreHandle_t s_power_off_done;
static volatile esp_err_t s_power_off_result = ESP_FAIL;

typedef struct {
    uint8_t mode;
    uint32_t interval_ms;
} user_led_runtime_t;

typedef struct {
    uint8_t type;
    uint8_t source;
    uint32_t value;
} user_led_event_t;

typedef struct {
    uint8_t green_mode;
    uint32_t green_interval_ms;
    uint8_t red_mode;
    uint32_t red_interval_ms;
    const char *reason;
} user_led_effect_t;

static user_led_state_t s_base_state = USER_LED_STATE_BOOTING;
static user_led_runtime_t s_red_runtime;
static user_led_runtime_t s_green_runtime;
static uint16_t s_activity_count[USER_LED_ACTIVITY_COUNT];
static uint32_t s_fault_flags;
static bool s_activity_delay_armed;
static TickType_t s_activity_blink_deadline;
static bool s_success_active;
static bool s_operation_fail_active;
static TickType_t s_temporary_result_deadline;
static bool s_apply_retry_armed;
static bool s_apply_retry_exhausted_logged;
static uint8_t s_apply_retry_count;
static TickType_t s_apply_retry_deadline;
static bool s_ota_active;
static bool s_factory_reset_active;
static bool s_restart_pending;
static bool s_power_off_pending;
static bool s_shutdown_pending;

static bool set_ch583_led_level(const char *port, int pin, const char *level)
{
    int ret = ch583_wifi_uart_send_gpio(port, pin, "OUT", level);
    if (ret < 0) {
        ESP_LOGE(TAG, "CH583 LED set failed port=%s pin=%d level=%s ret=%d",
                 port, pin, level, ret);
        return false;
    }
    return true;
}

static bool set_red(bool on)
{
    return set_ch583_led_level(USER_LED_CH583_RED_PORT,
                               USER_LED_CH583_RED_PIN,
                               on ? USER_LED_CH583_ON_LEVEL : USER_LED_CH583_OFF_LEVEL);
}

static bool set_green(bool on)
{
    return set_ch583_led_level(USER_LED_CH583_GREEN_PORT,
                               USER_LED_CH583_GREEN_PIN,
                               on ? USER_LED_CH583_ON_LEVEL : USER_LED_CH583_OFF_LEVEL);
}

static bool stop_blink(const char *led, user_led_runtime_t *runtime)
{
    if (runtime == NULL || runtime->mode != USER_LED_MODE_BLINK) {
        return true;
    }

    int ret = ch583_wifi_uart_send_led_blink_stop(led);
    if (ret < 0) {
        if (s_apply_retry_count == 0) {
            ESP_LOGE(TAG, "LED_BLINK_STOP failed led=%s ret=%d", led, ret);
        }
        return false;
    }

    if (s_apply_retry_count > 0) {
        ESP_LOGI(TAG, "LED_BLINK_STOP completed led=%s retries=%u",
                 led, (unsigned int)s_apply_retry_count);
    }
    runtime->mode = USER_LED_MODE_OFF;
    runtime->interval_ms = 0;
    return true;
}

static bool start_blink(const char *led, uint32_t interval_ms, user_led_runtime_t *runtime)
{
    if (runtime == NULL || interval_ms == 0) {
        return false;
    }
    if (runtime->mode == USER_LED_MODE_BLINK && runtime->interval_ms == interval_ms) {
        return true;
    }

    int ret = ch583_wifi_uart_send_led_blink(led, interval_ms);
    if (ret < 0) {
        ESP_LOGE(TAG, "CH583 LED blink start failed led=%s interval_ms=%lu ret=%d",
                 led, (unsigned long)interval_ms, ret);
        return false;
    }

    runtime->mode = USER_LED_MODE_BLINK;
    runtime->interval_ms = interval_ms;
    return true;
}

static bool apply_one_led(const char *led,
                          bool is_red,
                          uint8_t target_mode,
                          uint32_t interval_ms,
                          user_led_runtime_t *runtime)
{
    if (runtime == NULL) {
        return false;
    }
    if (target_mode == USER_LED_MODE_BLINK) {
        return start_blink(led, interval_ms, runtime);
    }
    if (runtime->mode == USER_LED_MODE_UNKNOWN) {
        int ret = ch583_wifi_uart_send_led_blink_stop(led);
        if (ret < 0) {
            ESP_LOGE(TAG, "CH583 LED unknown-state stop failed led=%s ret=%d", led, ret);
            return false;
        }
        runtime->mode = USER_LED_MODE_OFF;
        runtime->interval_ms = 0;
    }
    if (runtime->mode == USER_LED_MODE_BLINK && !stop_blink(led, runtime)) {
        return false;
    }
    if (runtime->mode == target_mode) {
        return true;
    }

    bool ok = is_red ? set_red(target_mode == USER_LED_MODE_SOLID)
                     : set_green(target_mode == USER_LED_MODE_SOLID);
    if (ok) {
        runtime->mode = target_mode;
        runtime->interval_ms = 0;
    }
    return ok;
}

static uint32_t normal_activity_total(void)
{
    return (uint32_t)s_activity_count[USER_LED_ACTIVITY_NETWORK] +
           (uint32_t)s_activity_count[USER_LED_ACTIVITY_UART_RX] +
           (uint32_t)s_activity_count[USER_LED_ACTIVITY_UART_TX];
}

static void select_base_green(user_led_effect_t *effect)
{
    effect->green_mode = USER_LED_MODE_OFF;
    effect->green_interval_ms = 0;
    switch (s_base_state) {
    case USER_LED_STATE_BOOTING:
        effect->green_mode = USER_LED_MODE_SOLID;
        break;
    case USER_LED_STATE_WIFI_CONNECTING:
        effect->green_mode = USER_LED_MODE_BLINK;
        effect->green_interval_ms = USER_LED_WIFI_CONNECT_BLINK_MS;
        break;
    case USER_LED_STATE_SERVER_READY:
        effect->green_mode = USER_LED_MODE_BLINK;
        effect->green_interval_ms = USER_LED_READY_BLINK_MS;
        break;
    default:
        break;
    }
}

static user_led_effect_t select_effect(void)
{
    user_led_effect_t effect = {
        .green_mode = USER_LED_MODE_OFF,
        .red_mode = USER_LED_MODE_OFF,
        .reason = "off",
    };

    if (s_shutdown_pending) {
        effect.reason = "power_off";
        return effect;
    }
    if (s_power_off_pending) {
        effect.green_mode = USER_LED_MODE_SOLID;
        effect.reason = "power_off_countdown";
        return effect;
    }
    if (s_restart_pending || (s_fault_flags & USER_LED_FAULT_FATAL) != 0) {
        effect.red_mode = USER_LED_MODE_SOLID;
        effect.reason = s_restart_pending ? "restart_pending" : "fatal";
        return effect;
    }
    if (s_ota_active) {
        effect.green_mode = USER_LED_MODE_SOLID;
        effect.red_mode = USER_LED_MODE_BLINK;
        effect.red_interval_ms = USER_LED_MID_BLINK_MS;
        effect.reason = "ota";
        return effect;
    }
    if (s_factory_reset_active) {
        effect.green_mode = USER_LED_MODE_BLINK;
        effect.green_interval_ms = USER_LED_FAST_BLINK_MS;
        effect.red_mode = USER_LED_MODE_SOLID;
        effect.reason = "factory_reset";
        return effect;
    }
    if ((s_fault_flags & (USER_LED_FAULT_WIFI_NO_CONFIG | USER_LED_FAULT_WIFI_AUTH)) != 0) {
        effect.red_mode = USER_LED_MODE_BLINK;
        effect.red_interval_ms = USER_LED_WIFI_ERROR_BLINK_MS;
        effect.reason = "wifi_fault";
        return effect;
    }
    if ((s_fault_flags & (USER_LED_FAULT_HTTP_SERVICE | USER_LED_FAULT_STORAGE)) != 0) {
        effect.red_mode = USER_LED_MODE_BLINK;
        effect.red_interval_ms = USER_LED_SERVICE_ERROR_BLINK_MS;
        effect.reason = "service_fault";
        return effect;
    }
    select_base_green(&effect);
    if (s_activity_count[USER_LED_ACTIVITY_EPD] > 0) {
        effect.red_mode = USER_LED_MODE_BLINK;
        effect.red_interval_ms = USER_LED_EPD_ACTIVITY_BLINK_MS;
        effect.reason = "epd";
        return effect;
    }
    if (normal_activity_total() > 0) {
        effect.red_mode = s_activity_delay_armed ? USER_LED_MODE_SOLID : USER_LED_MODE_BLINK;
        effect.red_interval_ms = s_activity_delay_armed ? 0 : USER_LED_NETWORK_ACTIVITY_BLINK_MS;
        effect.reason = s_activity_delay_armed ? "short_activity" : "data_activity";
        return effect;
    }
    if (s_success_active) {
        effect.green_mode = USER_LED_MODE_SOLID;
        effect.red_mode = USER_LED_MODE_OFF;
        effect.reason = "success";
        return effect;
    }
    if (s_operation_fail_active) {
        effect.red_mode = USER_LED_MODE_SOLID;
        effect.reason = "operation_fail";
        return effect;
    }

    effect.reason = "base";
    return effect;
}

static bool required_blink_stop_pending(const user_led_effect_t *effect)
{
    if (effect == NULL) {
        return false;
    }

    // A successful LED_BLINK is represented by runtime mode BLINK. Leaving
    // that mode must keep retrying the matching LED_BLINK_STOP until it is sent.
    return (s_green_runtime.mode == USER_LED_MODE_BLINK &&
            effect->green_mode != USER_LED_MODE_BLINK) ||
           (s_red_runtime.mode == USER_LED_MODE_BLINK &&
            effect->red_mode != USER_LED_MODE_BLINK);
}

static bool apply_effect(void)
{
    user_led_effect_t effect = select_effect();
    bool green_changed = s_green_runtime.mode != effect.green_mode ||
                         (effect.green_mode == USER_LED_MODE_BLINK &&
                          s_green_runtime.interval_ms != effect.green_interval_ms);
    bool red_changed = s_red_runtime.mode != effect.red_mode ||
                       (effect.red_mode == USER_LED_MODE_BLINK &&
                        s_red_runtime.interval_ms != effect.red_interval_ms);

