tdxguiping/ESP32_S3_epaper/main/led_status/led_status.c
    bool green_ok = !green_changed ||
                    apply_one_led("GREEN", false, effect.green_mode,
                                  effect.green_interval_ms, &s_green_runtime);
    bool red_ok = !red_changed ||
                  apply_one_led("RED", true, effect.red_mode,
                                effect.red_interval_ms, &s_red_runtime);
    bool applied = green_ok && red_ok;
    if ((green_changed || red_changed) && applied) {
        ESP_LOGI(TAG,
                 "effect applied reason=%s green_mode=%u green_ms=%lu red_mode=%u red_ms=%lu",
                 effect.reason,
                 (unsigned int)effect.green_mode,
                 (unsigned long)effect.green_interval_ms,
                 (unsigned int)effect.red_mode,
                 (unsigned long)effect.red_interval_ms);
    }
    if (applied) {
        s_apply_retry_armed = false;
        s_apply_retry_count = 0;
        s_apply_retry_exhausted_logged = false;
        return true;
    }

    if (required_blink_stop_pending(&effect)) {
        // Normal cosmetic commands keep their bounded retry policy, but a
        // successful LED_BLINK must not be left without its matching STOP.
        if (s_apply_retry_count < UINT8_MAX) {
            s_apply_retry_count++;
        }
        s_apply_retry_armed = true;
        s_apply_retry_deadline = xTaskGetTickCount() +
                                 pdMS_TO_TICKS(USER_LED_APPLY_RETRY_MS);
        if (s_apply_retry_count >= USER_LED_APPLY_RETRY_MAX &&
            !s_apply_retry_exhausted_logged) {
            s_apply_retry_exhausted_logged = true;
            ESP_LOGW(TAG,
                     "LED_BLINK_STOP still pending reason=%s retries=%u, keep retrying",
                     effect.reason, (unsigned int)s_apply_retry_count);
        }
        return false;
    }

    if (s_apply_retry_count < USER_LED_APPLY_RETRY_MAX) {
        s_apply_retry_count++;
        s_apply_retry_armed = true;
        s_apply_retry_deadline = xTaskGetTickCount() +
                                 pdMS_TO_TICKS(USER_LED_APPLY_RETRY_MS);
    } else if (!s_apply_retry_exhausted_logged) {
        s_apply_retry_exhausted_logged = true;
        ESP_LOGW(TAG, "LED effect retries exhausted reason=%s retries=%u",
                 effect.reason, (unsigned int)s_apply_retry_count);
    }
    return false;
}

static bool deadline_reached(TickType_t now, TickType_t deadline)
{
    return (int32_t)(now - deadline) >= 0;
}

static TickType_t deadline_wait(TickType_t now, TickType_t deadline)
{
    int32_t remaining = (int32_t)(deadline - now);
    return remaining > 0 ? (TickType_t)remaining : 0;
}

static TickType_t next_wait_ticks(void)
{
    TickType_t now = xTaskGetTickCount();
    TickType_t wait_ticks = portMAX_DELAY;
    if (s_activity_delay_armed) {
        wait_ticks = deadline_wait(now, s_activity_blink_deadline);
    }
    if (s_success_active || s_operation_fail_active) {
        TickType_t result_wait = deadline_wait(now, s_temporary_result_deadline);
        if (wait_ticks == portMAX_DELAY || result_wait < wait_ticks) {
            wait_ticks = result_wait;
        }
    }
    if (s_apply_retry_armed) {
        TickType_t retry_wait = deadline_wait(now, s_apply_retry_deadline);
        if (wait_ticks == portMAX_DELAY || retry_wait < wait_ticks) {
            wait_ticks = retry_wait;
        }
    }
    return wait_ticks;
}

static void expire_timers(void)
{
    TickType_t now = xTaskGetTickCount();
    if (s_activity_delay_armed && deadline_reached(now, s_activity_blink_deadline)) {
        s_activity_delay_armed = false;
    }
    if ((s_success_active || s_operation_fail_active) &&
        deadline_reached(now, s_temporary_result_deadline)) {
        s_success_active = false;
        s_operation_fail_active = false;
        ESP_LOGI(TAG, "temporary result indication expired");
    }
    if (s_apply_retry_armed && deadline_reached(now, s_apply_retry_deadline)) {
        s_apply_retry_armed = false;
    }
}

static void set_fault(uint32_t fault_mask, bool active)
{
    if (active) {
        s_fault_flags |= fault_mask;
    } else {
        s_fault_flags &= ~fault_mask;
    }
}

static void handle_state(user_led_state_t state)
{
    bool changed = true;
    switch (state) {
    case USER_LED_STATE_OFF:
    case USER_LED_STATE_BOOTING:
        changed = s_base_state != state;
        s_base_state = state;
        break;
    case USER_LED_STATE_WIFI_CONNECTING:
        changed = s_base_state != state;
        s_base_state = state;
        set_fault(USER_LED_FAULT_WIFI_NO_CONFIG |
                  USER_LED_FAULT_WIFI_AUTH |
                  USER_LED_FAULT_HTTP_SERVICE, false);
        break;
    case USER_LED_STATE_SERVER_READY:
        changed = s_base_state != state;
        s_base_state = state;
        set_fault(USER_LED_FAULT_WIFI_NO_CONFIG |
                  USER_LED_FAULT_WIFI_AUTH |
                  USER_LED_FAULT_HTTP_SERVICE, false);
        break;
    case USER_LED_STATE_EPD_REFRESH:
    case USER_LED_STATE_EPD_FINISHED:
        ESP_LOGW(TAG, "EPD state requires ActivityBegin/ActivityEnd source tracking");
        return;
    case USER_LED_STATE_SUCCESS:
        s_success_active = true;
        s_operation_fail_active = false;
        s_temporary_result_deadline = xTaskGetTickCount() + pdMS_TO_TICKS(USER_LED_SUCCESS_HOLD_MS);
        break;
    case USER_LED_STATE_WIFI_FAIL:
        changed = (s_fault_flags & USER_LED_FAULT_WIFI_AUTH) == 0;
        set_fault(USER_LED_FAULT_WIFI_AUTH, true);
        break;
    case USER_LED_STATE_OPERATION_FAIL:
        s_success_active = false;
        s_operation_fail_active = true;
        s_temporary_result_deadline = xTaskGetTickCount() + pdMS_TO_TICKS(USER_LED_OPERATION_FAIL_HOLD_MS);
        break;
    case USER_LED_STATE_TRANSFER:
        ESP_LOGW(TAG, "TRANSFER state requires ActivityBegin/ActivityEnd source tracking");
        return;
    default:
        ESP_LOGW(TAG, "invalid business state=%d", (int)state);
        return;
    }
    if (changed) {
        ESP_LOGI(TAG, "business state=%d", (int)state);
    }
}

static void handle_activity(uint8_t source, bool begin)
{
    if (source >= USER_LED_ACTIVITY_COUNT) {
        ESP_LOGW(TAG, "invalid activity source=%u", (unsigned int)source);
        return;
    }

    uint32_t normal_before = normal_activity_total();
    if (begin) {
        if (s_activity_count[source] == UINT16_MAX) {
            ESP_LOGW(TAG, "activity counter saturated source=%u", (unsigned int)source);
            return;
        }
        s_activity_count[source]++;
        if (source != USER_LED_ACTIVITY_EPD && normal_before == 0) {
            s_activity_delay_armed = true;
            s_activity_blink_deadline = xTaskGetTickCount() +
                                        pdMS_TO_TICKS(USER_LED_ACTIVITY_BLINK_DELAY_MS);
        }
        return;
    }

    if (s_activity_count[source] == 0) {
        ESP_LOGW(TAG, "activity end without begin source=%u", (unsigned int)source);
        return;
    }
    s_activity_count[source]--;
    if (source != USER_LED_ACTIVITY_EPD && normal_activity_total() == 0) {
        s_activity_delay_armed = false;
    }
}

static bool force_all_leds_off(void)
{
    int ret = ch583_wifi_uart_send_led_blink_stop("RED");
    bool red_stop_ok = ret >= 0;
    if (!red_stop_ok) {
        ESP_LOGE(TAG, "force RED blink stop failed ret=%d", ret);
    }
    vTaskDelay(pdMS_TO_TICKS(100));
    bool red_gpio_ok = set_red(false);
    vTaskDelay(pdMS_TO_TICKS(100));
    ret = ch583_wifi_uart_send_led_blink_stop("GREEN");
    bool green_stop_ok = ret >= 0;
    if (!green_stop_ok) {
        ESP_LOGE(TAG, "force GREEN blink stop failed ret=%d", ret);
    }
    vTaskDelay(pdMS_TO_TICKS(100));
    bool green_gpio_ok = set_green(false);

    if (red_stop_ok && red_gpio_ok) {
        s_red_runtime = (user_led_runtime_t){.mode = USER_LED_MODE_OFF};
    }
    if (green_stop_ok && green_gpio_ok) {
        s_green_runtime = (user_led_runtime_t){.mode = USER_LED_MODE_OFF};
    }
    return red_stop_ok && red_gpio_ok && green_stop_ok && green_gpio_ok;
}

static void handle_event(const user_led_event_t *event)
{
    if (event == NULL) {
        return;
    }
    if (event->type == USER_LED_EVENT_CANCEL_POWER_OFF) {
        bool lock_was_active = s_shutdown_pending;
        s_shutdown_pending = false;
        s_power_off_pending = false;
        bool restored = apply_effect();
        s_power_off_result = restored ? ESP_OK : ESP_FAIL;
        if (lock_was_active) {
            if (restored) {
                ESP_LOGI(TAG, "power-off lock canceled, base LED effect restored");
            } else {
                ESP_LOGE(TAG, "power-off lock canceled but base LED effect restore failed");
            }
        }
        if (s_power_off_done != NULL) {
            if (xSemaphoreGive(s_power_off_done) != pdTRUE) {
                ESP_LOGW(TAG, "power-off cancel result semaphore already full");
            }
        }
        return;
    }
    if (event->type == USER_LED_EVENT_PREPARE_POWER_OFF) {
        bool all_off = force_all_leds_off();
        s_power_off_result = all_off ? ESP_OK : ESP_FAIL;
        if (all_off) {
            s_shutdown_pending = true;
            s_power_off_pending = false;
            s_activity_delay_armed = false;
            s_success_active = false;
            s_operation_fail_active = false;
            memset(s_activity_count, 0, sizeof(s_activity_count));
            ESP_LOGI(TAG, "power-off lock active, both LED commands completed");
        } else {
            ESP_LOGE(TAG, "power-off LED shutdown failed, keep system state active");
        }
        if (s_power_off_done != NULL) {
            if (xSemaphoreGive(s_power_off_done) != pdTRUE) {
                ESP_LOGW(TAG, "power-off result semaphore already full");
            }
        }
        return;
    }
    if (event->type == USER_LED_EVENT_REAPPLY_CURRENT) {
        if (s_shutdown_pending) {
            ESP_LOGW(TAG, "DEVICE_INFO LED reapply skipped during power-off lock");
            return;
        }

        // The protocol gate may have rejected earlier GPIO writes while the cached mode
        // already advanced. Force a known physical state before applying the latest effect.
        bool reset_ok = force_all_leds_off();
        bool apply_ok = apply_effect();
        if (reset_ok && apply_ok) {
            ESP_LOGI(TAG, "DEVICE_INFO LED state reapplied");
        } else {
            ESP_LOGE(TAG, "DEVICE_INFO LED reapply failed reset=%d apply=%d",
                     reset_ok ? 1 : 0, apply_ok ? 1 : 0);
        }
        return;
    }
    if (s_shutdown_pending) {
        return;
    }

    switch (event->type) {
    case USER_LED_EVENT_SET_STATE:
        handle_state((user_led_state_t)event->value);
        break;
    case USER_LED_EVENT_ACTIVITY_BEGIN:
        handle_activity(event->source, true);
        break;
    case USER_LED_EVENT_ACTIVITY_END:
        handle_activity(event->source, false);
        break;
    case USER_LED_EVENT_SET_FAULT:
        set_fault(event->value, true);
        break;
    case USER_LED_EVENT_CLEAR_FAULT:
        set_fault(event->value, false);
        break;
    case USER_LED_EVENT_SHOW_SUCCESS:
        handle_state(USER_LED_STATE_SUCCESS);
        break;
    case USER_LED_EVENT_SHOW_OPERATION_FAIL:
        handle_state(USER_LED_STATE_OPERATION_FAIL);
        break;
    case USER_LED_EVENT_OTA_BEGIN:
        s_ota_active = true;
        break;
    case USER_LED_EVENT_OTA_END:
        s_ota_active = false;
        if (event->value != 0) {
            s_restart_pending = true;
        }
        break;
    case USER_LED_EVENT_FACTORY_RESET_BEGIN:
        s_factory_reset_active = true;
        break;
    case USER_LED_EVENT_FACTORY_RESET_END:
        s_factory_reset_active = false;
        break;
    case USER_LED_EVENT_POWER_OFF_PENDING:
        s_power_off_pending = event->value != 0;
        break;
    case USER_LED_EVENT_RESTART_PENDING:
        s_restart_pending = event->value != 0;
        break;
    default:
        ESP_LOGW(TAG, "unknown LED event type=%u", (unsigned int)event->type);
        break;
    }
}

static void UserLedStatus_Task(void *arg)
{
    (void)arg;
    if (!force_all_leds_off()) {
        ESP_LOGW(TAG, "initial LED shutdown incomplete, apply target with bounded retry");
    }
    (void)apply_effect();

