tdxguiping/ESP32_S3_epaper/main/led_status/led_status.c
    for (;;) {
        user_led_event_t event = {0};
        TickType_t wait_ticks = next_wait_ticks();
        if (xQueueReceive(s_led_event_queue, &event, wait_ticks) == pdTRUE) {
            s_apply_retry_armed = false;
            s_apply_retry_count = 0;
            s_apply_retry_exhausted_logged = false;
            handle_event(&event);
        } else {
            expire_timers();
        }
        if (!s_shutdown_pending) {
            expire_timers();
            (void)apply_effect();
        }
    }
}

static bool post_event_wait(const user_led_event_t *event,
                            bool high_priority,
                            TickType_t wait_ticks)
{
#if USER_LED_STATUS_ENABLE
    if (event == NULL || s_led_event_queue == NULL || s_led_task == NULL) {
        ESP_LOGW(TAG, "LED event rejected before initialization");
        return false;
    }
    BaseType_t result = high_priority
        ? xQueueSendToFront(s_led_event_queue, event, wait_ticks)
        : xQueueSend(s_led_event_queue, event, wait_ticks);
    if (result != pdTRUE) {
        ESP_LOGW(TAG, "LED event queue full type=%u source=%u",
                 (unsigned int)event->type, (unsigned int)event->source);
        return false;
    }
    return true;
#else
    (void)event;
    (void)high_priority;
    (void)wait_ticks;
    return false;
#endif
}

static bool post_event(const user_led_event_t *event, bool high_priority)
{
    TickType_t wait_ticks = pdMS_TO_TICKS(high_priority
        ? USER_LED_POWER_OFF_EVENT_POST_WAIT_MS
        : USER_LED_EVENT_POST_WAIT_MS);
    return post_event_wait(event, high_priority, wait_ticks);
}

static void post_simple_event(uint8_t type, uint8_t source, uint32_t value)
{
    user_led_event_t event = {
        .type = type,
        .source = source,
        .value = value,
    };
    (void)post_event(&event, false);
}

esp_err_t UserLedStatus_Init(void)
{
#if USER_LED_STATUS_ENABLE
    if (s_led_task != NULL) {
        return ESP_OK;
    }
    if (s_power_off_done == NULL) {
        s_power_off_done = xSemaphoreCreateBinary();
        if (s_power_off_done == NULL) {
            ESP_LOGE(TAG, "create LED power-off semaphore failed");
            return ESP_ERR_NO_MEM;
        }
    }
    if (s_led_event_queue == NULL) {
        s_led_event_queue = xQueueCreate(USER_LED_EVENT_QUEUE_LENGTH,
                                         sizeof(user_led_event_t));
        if (s_led_event_queue == NULL) {
            ESP_LOGE(TAG, "create LED event queue failed");
            vSemaphoreDelete(s_power_off_done);
            s_power_off_done = NULL;
            return ESP_ERR_NO_MEM;
        }
    }

    s_base_state = USER_LED_STATE_BOOTING;
    s_fault_flags = 0;
    s_activity_delay_armed = false;
    s_success_active = false;
    s_operation_fail_active = false;
    s_apply_retry_armed = false;
    s_apply_retry_exhausted_logged = false;
    s_apply_retry_count = 0;
    s_ota_active = false;
    s_factory_reset_active = false;
    s_restart_pending = false;
    s_power_off_pending = false;
    s_shutdown_pending = false;
    memset(s_activity_count, 0, sizeof(s_activity_count));
    s_red_runtime = (user_led_runtime_t){.mode = USER_LED_MODE_UNKNOWN};
    s_green_runtime = (user_led_runtime_t){.mode = USER_LED_MODE_UNKNOWN};

    BaseType_t task_ret = xTaskCreate(UserLedStatus_Task,
                                      "led_status",
                                      USER_LED_STATUS_TASK_STACK_SIZE,
                                      NULL,
                                      USER_LED_STATUS_TASK_PRIORITY,
                                      &s_led_task);
    if (task_ret != pdPASS) {
        ESP_LOGE(TAG, "create LED task failed");
        vQueueDelete(s_led_event_queue);
        s_led_event_queue = NULL;
        vSemaphoreDelete(s_power_off_done);
        s_power_off_done = NULL;
        s_led_task = NULL;
        return ESP_ERR_NO_MEM;
    }
    ESP_LOGI(TAG,
             "single LED task started ready_ms=%u wifi_ms=%u activity_ms=%u epd_ms=%u",
             (unsigned int)USER_LED_READY_BLINK_MS,
             (unsigned int)USER_LED_WIFI_CONNECT_BLINK_MS,
             (unsigned int)USER_LED_NETWORK_ACTIVITY_BLINK_MS,
             (unsigned int)USER_LED_EPD_ACTIVITY_BLINK_MS);
    return ESP_OK;
#else
    ESP_LOGW(TAG, "LED status disabled by USER_LED_STATUS_ENABLE");
    return ESP_OK;
#endif
}

void UserLedStatus_Set(user_led_state_t state)
{
    post_simple_event(USER_LED_EVENT_SET_STATE, 0, (uint32_t)state);
}

void UserLedStatus_ActivityBegin(user_led_activity_t source)
{
    user_led_event_t event = {
        .type = USER_LED_EVENT_ACTIVITY_BEGIN,
        .source = (uint8_t)source,
    };
    (void)post_event_wait(&event, false, portMAX_DELAY);
}

void UserLedStatus_ActivityEnd(user_led_activity_t source)
{
    user_led_event_t event = {
        .type = USER_LED_EVENT_ACTIVITY_END,
        .source = (uint8_t)source,
    };
    (void)post_event_wait(&event, false, portMAX_DELAY);
}

static void post_fault(uint32_t fault, bool active)
{
    post_simple_event(active ? USER_LED_EVENT_SET_FAULT : USER_LED_EVENT_CLEAR_FAULT,
                      0, fault);
}

void UserLedStatus_SetWifiNoConfig(bool active)
{
    post_fault(USER_LED_FAULT_WIFI_NO_CONFIG, active);
}

void UserLedStatus_SetWifiAuthFailed(bool active)
{
    post_fault(USER_LED_FAULT_WIFI_AUTH, active);
}

void UserLedStatus_SetHttpFailed(bool active)
{
    post_fault(USER_LED_FAULT_HTTP_SERVICE, active);
}

void UserLedStatus_SetStorageFailed(bool active)
{
    post_fault(USER_LED_FAULT_STORAGE, active);
}

void UserLedStatus_SetFatalError(bool active)
{
    post_fault(USER_LED_FAULT_FATAL, active);
}

void UserLedStatus_ShowSuccess(void)
{
    post_simple_event(USER_LED_EVENT_SHOW_SUCCESS, 0, 0);
}

void UserLedStatus_ShowOperationFail(void)
{
    post_simple_event(USER_LED_EVENT_SHOW_OPERATION_FAIL, 0, 0);
}

void UserLedStatus_OtaBegin(void)
{
    post_simple_event(USER_LED_EVENT_OTA_BEGIN, 0, 0);
}

void UserLedStatus_OtaEnd(bool preparing_restart)
{
    post_simple_event(USER_LED_EVENT_OTA_END, 0, preparing_restart ? 1U : 0U);
}

