tdxguiping/ESP32_S3_epaper/main/led_status/led_status.c
void UserLedStatus_FactoryResetBegin(void)
{
    post_simple_event(USER_LED_EVENT_FACTORY_RESET_BEGIN, 0, 0);
}

void UserLedStatus_FactoryResetEnd(void)
{
    post_simple_event(USER_LED_EVENT_FACTORY_RESET_END, 0, 0);
}

void UserLedStatus_SetRestartPending(bool active)
{
    post_simple_event(USER_LED_EVENT_RESTART_PENDING, 0, active ? 1U : 0U);
}

void UserLedStatus_SetPowerOffPending(bool active)
{
    post_simple_event(USER_LED_EVENT_POWER_OFF_PENDING, 0, active ? 1U : 0U);
}

esp_err_t UserLedStatus_ReapplyCurrent(void)
{
#if USER_LED_STATUS_ENABLE
    if (s_led_event_queue == NULL || s_led_task == NULL) {
        // Normal startup initializes UART before the LED task. If DEVICE_INFO arrives
        // in that short window, UserLedStatus_Task() will perform the same calibration.
        ESP_LOGW(TAG, "DEVICE_INFO ready before LED task, startup calibration will apply state");
        return ESP_OK;
    }

    user_led_event_t event = {
        .type = USER_LED_EVENT_REAPPLY_CURRENT,
    };
    // Put recovery ahead of queued cosmetic state changes and allow the bounded
    // high-priority wait so the physical-state repair is not silently dropped.
    return post_event(&event, true) ? ESP_OK : ESP_ERR_TIMEOUT;
#else
    return ESP_OK;
#endif
}

esp_err_t UserLedStatus_PreparePowerOffSync(void)
{
#if USER_LED_STATUS_ENABLE
    if (s_led_event_queue == NULL || s_led_task == NULL || s_power_off_done == NULL) {
        ESP_LOGE(TAG, "prepare power off failed because LED task is not ready");
        return ESP_ERR_INVALID_STATE;
    }

    (void)xSemaphoreTake(s_power_off_done, 0);
    s_power_off_result = ESP_FAIL;
    user_led_event_t event = {
        .type = USER_LED_EVENT_PREPARE_POWER_OFF,
    };
    if (!post_event(&event, true)) {
        ESP_LOGE(TAG, "prepare power off event post failed");
        return ESP_ERR_TIMEOUT;
    }
    if (xSemaphoreTake(s_power_off_done,
                       pdMS_TO_TICKS(USER_LED_POWER_OFF_ACK_TIMEOUT_MS)) != pdTRUE) {
        ESP_LOGE(TAG, "prepare power off LED acknowledgement timeout");
        return ESP_ERR_TIMEOUT;
    }
    if (s_power_off_result != ESP_OK) {
        ESP_LOGE(TAG, "prepare power off LED shutdown failed ret=%s",
                 esp_err_to_name(s_power_off_result));
    }
    return s_power_off_result;
#else
    return ESP_OK;
#endif
}

esp_err_t UserLedStatus_CancelPowerOffSync(void)
{
#if USER_LED_STATUS_ENABLE
    if (s_led_event_queue == NULL || s_led_task == NULL || s_power_off_done == NULL) {
        ESP_LOGE(TAG, "cancel power off failed because LED task is not ready");
        return ESP_ERR_INVALID_STATE;
    }

    (void)xSemaphoreTake(s_power_off_done, 0);
    s_power_off_result = ESP_FAIL;
    user_led_event_t event = {
        .type = USER_LED_EVENT_CANCEL_POWER_OFF,
    };
    if (!post_event(&event, true)) {
        ESP_LOGE(TAG, "cancel power off event post failed");
        return ESP_ERR_TIMEOUT;
    }
    if (xSemaphoreTake(s_power_off_done,
                       pdMS_TO_TICKS(USER_LED_POWER_OFF_ACK_TIMEOUT_MS)) != pdTRUE) {
        ESP_LOGE(TAG, "cancel power off LED acknowledgement timeout");
        return ESP_ERR_TIMEOUT;
    }
    if (s_power_off_result != ESP_OK) {
        ESP_LOGE(TAG, "cancel power off LED restore failed ret=%s",
                 esp_err_to_name(s_power_off_result));
    }
    return s_power_off_result;
#else
    return ESP_OK;
#endif
}

void UserLedStatus_PreparePowerOff(void)
{
    (void)UserLedStatus_PreparePowerOffSync();
}
